app/controllers/posts_controller.rb

SELECT "authors".* FROM "authors"
SELECT "posts".* FROM "posts" WHERE (created_at >= '2017-06-20 00:00:00.000000')
---
  def index
    @authors = Author.all

    if params[:author].present?
      @posts = Post.by_author(params[:author])
    elsif params[:date] == 'Today'
      @posts = Post.from_today
    elsif params[:date] == 'Old News'
      @posts = Post.old_news
    else
      @posts = Post.all